names = ['lesha','dima','vera','kris']

print(f'\n{names} - просто список')

print('\n-------------------------------------------------------------\n')

print(f'{sorted(names)} - сортировка по алфавиту')
print(f'{names} - проверяем что сортировка методом sorted() не навсегда')

print('\n-------------------------------------------------------------\n')

print(f'{sorted(names, reverse = True)} - сортировка в обратном алфавитном порядке')
print(f'{names} - проверяем что сортировка методом sorted() не навсегда')

print('\n-------------------------------------------------------------\n')

names.reverse() #Меняет список в обратно порядке - не по алфавиту
print(f'{names} - меняем список в обратно порядке - не по алфавиту')

print('\n-------------------------------------------------------------\n')

names.reverse() #Возвращаем список в исходный вариант
print(f'{names} - возвращаем список в исходный вариант')

print('\n-------------------------------------------------------------\n')

names.sort()
print(f'{names} - метод sort() изменяет порядок элементов навсегда в алфавитном порядке')

print('\n-------------------------------------------------------------\n')

names.sort(reverse=True)
print(f'{names} - метод sort(reverse=True) изменяет порядок элементов навсегда в обратном алфавитном порядке')

print('\n-------------------------------------------------------------\n')

print(f'{len(names)} - длинна списка names\n') #Определяем длинну списка names

print('\n-------------------------------------------------------------')

bridges = ['razvodnoi','dlinnii','podvesnoi','krasivii']
print(bridges)

print('\n-------------------------------------------------------------\n')

bridges.sort(reverse=True)
print(bridges)

print(len(bridges))

bridges.reverse()
print(bridges)

print(sorted(bridges, reverse=True))
print(bridges)