# Создать список квадратов чисел от 0 до 4
# Здесь x**2 — выражение, которое выполняется для каждого x в диапазоне range(5)
squares = [x**2 for x in range(5)]
print(squares)  # [0, 1, 4, 9, 16]
